tutorials/incompressible/pimpleDyMFoam/mixerVesselAMI2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    rotor
    {
        type            wall;
        nFaces          192;
        startFace       5856;
    }
    stator
    {
        type            wall;
        nFaces          192;
        startFace       6048;
    }
    AMI1
    {
        type            cyclicAMI;
        nFaces          96;
        startFace       6240;
        matchTolerance  0.0001;
        neighbourPatch  AMI2;
        transform       noOrdering;
        surface
        {
            type            searchableCylinder;
            point1          ( 0 0 -1 );
            point2          ( 0 0 1 );
            radius          0.5;
        }
    }
    AMI2
    {
        type            cyclicAMI;
        nFaces          96;
        startFace       6336;
        matchTolerance  0.0001;
        neighbourPatch  AMI1;
        transform       noOrdering;
        surface
        {
            type            searchableCylinder;
            point1          ( 0 0 -1 );
            point2          ( 0 0 1 );
            radius          0.5;
        }
    }
    front
    {
        type            empty;
        nFaces          3072;
        startFace       6432;
    }
    back
    {
        type            empty;
        nFaces          3072;
        startFace       9504;
    }
)

// ************************************************************************* //
